{
    "steps": [
    {
      "type": "text",
      "value": "You’ve got $40 max to spend on a wine for a special occasion. Which wine are you buying?"
    },
    {
      "type": "text",
      "value": "Step 2"
    },
    {
      "type": "text",
      "value": "We scraped 9,300 wines off the popular app <a href=https://www.vivino.com/>Vivino</a> and used <a href=https://platform.openai.com/docs/guides/vision>Chat-GPT Vision</a> to help us categorize the animals on the labels with this prompt: <span class=prompt>This image is a wine label. Do you see any animals or humans on it?<a href=#methods></span> <span class=instructions >Read more in the methods.</span></a>"
    },
    {
      "type": "text",
      "value": "Sometimes it was spot on. It correctly identified all of these labels as birds even though the artistic styles were different."
    },
    {
      "type": "text",
      "value": "But other times, we had to manually review and edit. GPT was particularly bad with elephants. <br><br> It also struggled when animals weren’t the focal point and with what counted as an “animal.” <br><br> Sometimes anthropomorphic or mythical creatures were included, sometimes not."
    },
    {
      "type": "text",
      "value": "After cleaning up the data we grouped the animals into broad categories based more on common perception than binomial nomenclature (genus and species) — sorry science purists — and omitted categories with fewer than 20 animals, leaving us with these 16 groupings. Here’s your <span class=selected-animal-span>original animal</span>."
    },
    {
      "type": "text",
      "value": "To get a general understanding of the wines, we found the median price of each animal group."
    },
    {
      "type": "text",
      "value": "Then we looked at the rating."
    },
    {
      "type": "text",
      "value": "But that only gets us so far. What we really care about are the steals, wines whose <span class=bold>price is below the median</span> and whose <span class=bold>rating is above the median</span>. This is…"
    }
  ]
}